codeigniter/backend/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'abs@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $userModel = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $userModel->where('email', $email)->first();